# Data Visualization with Modern Data Science

> Data Wrangling with Pandas

Yao-Jen Kuo <yaojenkuo@ntu.edu.tw> from [DATAINPOINT](https://www.datainpoint.com/)

In [1]:
import re
import pandas as pd

## Basic attributes and methods

In [2]:
csv_url = "https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_daily_reports/02-28-2023.csv"
daily_report = pd.read_csv(csv_url)
type(daily_report)

pandas.core.frame.DataFrame

## Basic attributes of a `DataFrame` object

- `shape`
- `dtypes`
- `index`
- `columns`

In [3]:
print(daily_report.shape)
print(daily_report.dtypes)
print(daily_report.index)
print(daily_report.columns)

(4016, 14)
FIPS                   float64
Admin2                  object
Province_State          object
Country_Region          object
Last_Update             object
Lat                    float64
Long_                  float64
Confirmed                int64
Deaths                   int64
Recovered              float64
Active                 float64
Combined_Key            object
Incident_Rate          float64
Case_Fatality_Ratio    float64
dtype: object
RangeIndex(start=0, stop=4016, step=1)
Index(['FIPS', 'Admin2', 'Province_State', 'Country_Region', 'Last_Update',
       'Lat', 'Long_', 'Confirmed', 'Deaths', 'Recovered', 'Active',
       'Combined_Key', 'Incident_Rate', 'Case_Fatality_Ratio'],
      dtype='object')

## Basic methods of a `DataFrame` object

- `head(n)`
- `tail(n)`
- `describe()`
- `info()`
- `set_index()`
- `reset_index()`

## `head(n)` returns the top n observations with header

In [4]:
daily_report.head() # n is default to 5

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2023-03-01 04:21:02,33.93911,67.709953,209322,7896,NaN,NaN,Afghanistan,537.711073,3.772179
1,NaN,NaN,NaN,Albania,2023-03-01 04:21:02,41.15330,20.168300,334391,3598,NaN,NaN,Albania,11619.674752,1.075986
2,NaN,NaN,NaN,Algeria,2023-03-01 04:21:02,28.03390,1.659600,271441,6881,NaN,NaN,Algeria,619.006941,2.534989
3,NaN,NaN,NaN,Andorra,2023-03-01 04:21:02,42.50630,1.521800,47866,165,NaN,NaN,Andorra,61950.430337,0.344712
4,NaN,NaN,NaN,Angola,2023-03-01 04:21:02,-11.20270,17.873900,105255,1933,NaN,NaN,Angola,320.252363,1.836492

## `tail(n)` returns the bottom n observations with header

In [5]:
daily_report.tail(3)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4013,NaN,NaN,NaN,Yemen,2023-03-01 04:21:02,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4014,NaN,NaN,NaN,Zambia,2023-03-01 04:21:02,-13.133897,27.849332,343012,4057,NaN,NaN,Zambia,1865.822568,1.182757
4015,NaN,NaN,NaN,Zimbabwe,2023-03-01 04:21:02,-19.015438,29.154857,263921,5663,NaN,NaN,Zimbabwe,1775.700035,2.145718

## `describe()` returns the descriptive summary for numeric columns

In [6]:
daily_report.describe()

,FIPS,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
count,3268.000000,3925.000000,3925.000000,4.016000e+03,4016.000000,0.0,0.0,3922.000000,3975.000000
mean,32405.943390,35.736183,-71.109728,1.681579e+05,1711.325697,NaN,NaN,28441.653173,3.890604
std,18056.381177,13.441327,55.361480,1.065583e+06,8861.008507,NaN,NaN,10729.140265,125.500764
min,60.000000,-71.949900,-178.116500,0.000000e+00,0.000000,NaN,NaN,0.000000,0.000000
25%,19048.500000,33.191535,-96.595639,3.811250e+03,47.750000,NaN,NaN,24063.245882,0.891036
50%,30068.000000,37.895700,-86.717326,1.078150e+04,134.000000,NaN,NaN,29401.517006,1.282720
75%,47041.500000,42.176955,-77.357900,4.676800e+04,480.000000,NaN,NaN,34080.063562,1.734045
max,99999.000000,71.706900,178.065000,3.857927e+07,186138.000000,NaN,NaN,236094.674556,7761.538462

## `info()` returns the concise information of the dataframe

In [7]:
daily_report.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4016 entries, 0 to 4015
Data columns (total 14 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   FIPS                 3268 non-null   float64
 1   Admin2               3272 non-null   object
 2   Province_State       3837 non-null   object
 3   Country_Region       4016 non-null   object
 4   Last_Update          4016 non-null   object
 5   Lat                  3925 non-null   float64
 6   Long_                3925 non-null   float64
 7   Confirmed            4016 non-null   int64
 8   Deaths               4016 non-null   int64
 9   Recovered            0 non-null      float64
 10  Active               0 non-null      float64
 11  Combined_Key         4016 non-null   object
 12  Incident_Rate        3922 non-null   float64
 13  Case_Fatality_Ratio  3975 non-null   float64
dtypes: float64(7), int64(2), object(5)
memory usage: 439.4+ KB

## `set_index()` replaces current `Index` with a specific variable

In [8]:
daily_report.set_index('Combined_Key')

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
Combined_Key,,,,,,,,,,,,,
Afghanistan,NaN,NaN,NaN,Afghanistan,2023-03-01 04:21:02,33.939110,67.709953,209322,7896,NaN,NaN,537.711073,3.772179
Albania,NaN,NaN,NaN,Albania,2023-03-01 04:21:02,41.153300,20.168300,334391,3598,NaN,NaN,11619.674752,1.075986
Algeria,NaN,NaN,NaN,Algeria,2023-03-01 04:21:02,28.033900,1.659600,271441,6881,NaN,NaN,619.006941,2.534989
Andorra,NaN,NaN,NaN,Andorra,2023-03-01 04:21:02,42.506300,1.521800,47866,165,NaN,NaN,61950.430337,0.344712
Angola,NaN,NaN,NaN,Angola,2023-03-01 04:21:02,-11.202700,17.873900,105255,1933,NaN,NaN,320.252363,1.836492
...,...,...,...,...,...,...,...,...,...,...,...,...,...
West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2023-03-01 04:21:02,31.952200,35.233200,703228,5708,NaN,NaN,13784.956961,0.811686
Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2023-03-01 04:21:02,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
Yemen,NaN,NaN,NaN,Yemen,2023-03-01 04:21:02,15.552727,48.516388,11945,2159,NaN,NaN,40.048994,18.074508
Zambia,NaN,NaN,NaN,Zambia,2023-03-01 04:21:02,-13.133897,27.849332,343012,4057,NaN,NaN,1865.822568,1.182757
Zimbabwe,NaN,NaN,NaN,Zimbabwe,2023-03-01 04:21:02,-19.015438,29.154857,263921,5663,NaN,NaN,1775.700035,2.145718

## `reset_index()` resets current `Index` with default `RangeIndex`

In [9]:
daily_report.set_index('Combined_Key').reset_index()

,Combined_Key,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Incident_Rate,Case_Fatality_Ratio
0,Afghanistan,NaN,NaN,NaN,Afghanistan,2023-03-01 04:21:02,33.939110,67.709953,209322,7896,NaN,NaN,537.711073,3.772179
1,Albania,NaN,NaN,NaN,Albania,2023-03-01 04:21:02,41.153300,20.168300,334391,3598,NaN,NaN,11619.674752,1.075986
2,Algeria,NaN,NaN,NaN,Algeria,2023-03-01 04:21:02,28.033900,1.659600,271441,6881,NaN,NaN,619.006941,2.534989
3,Andorra,NaN,NaN,NaN,Andorra,2023-03-01 04:21:02,42.506300,1.521800,47866,165,NaN,NaN,61950.430337,0.344712
4,Angola,NaN,NaN,NaN,Angola,2023-03-01 04:21:02,-11.202700,17.873900,105255,1933,NaN,NaN,320.252363,1.836492
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4011,West Bank and Gaza,NaN,NaN,NaN,West Bank and Gaza,2023-03-01 04:21:02,31.952200,35.233200,703228,5708,NaN,NaN,13784.956961,0.811686
4012,Winter Olympics 2022,NaN,NaN,NaN,Winter Olympics 2022,2023-03-01 04:21:02,39.904200,116.407400,535,0,NaN,NaN,NaN,0.000000
4013,Yemen,NaN,NaN,NaN,Yemen,2023-03-01 04:21:02,15.552727,48.516388,11945,2159,NaN,NaN,40.048994,18.074508
4014,Zambia,NaN,NaN,NaN,Zambia,2023-03-01 04:21:02,-13.133897,27.849332,343012,4057,NaN,NaN,1865.822568,1.182757
4015,Zimbabwe,NaN,NaN,NaN,Zimbabwe,2023-03-01 04:21:02,-19.015438,29.154857,263921,5663,NaN,NaN,1775.700035,2.145718

## Basic Wrangling

## Basic wrangling is like writing SQL queries

- Selecting: `SELECT FROM`
- Filtering: `WHERE`
- Subset: `SELECT FROM WHERE`

## Basic wrangling is like writing SQL queries(cont'd)

- Indexing
- Sorting: `ORDER BY`
- Deriving
- Summarizing
- Summarizing and Grouping: `GROUP BY`

## Selecting a column as `Series`

In [10]:
print(daily_report['Country_Region'])
print(type(daily_report['Country_Region']))

0                Afghanistan
1                    Albania
2                    Algeria
3                    Andorra
4                     Angola
                ...
4011      West Bank and Gaza
4012    Winter Olympics 2022
4013                   Yemen
4014                  Zambia
4015                Zimbabwe
Name: Country_Region, Length: 4016, dtype: object
<class 'pandas.core.series.Series'>

## Selecting a column as `DataFrame`

In [11]:
print(type(daily_report[['Country_Region']]))
daily_report[['Country_Region']]

<class 'pandas.core.frame.DataFrame'>

            Country_Region
0              Afghanistan
1                  Albania
2                  Algeria
3                  Andorra
4                   Angola
...                    ...
4011    West Bank and Gaza
4012  Winter Olympics 2022
4013                 Yemen
4014                Zambia
4015              Zimbabwe

[4016 rows x 1 columns]

## Selecting multiple columns as `DataFrame`, for sure

In [12]:
cols = ['Country_Region', 'Confirmed', 'Deaths']
daily_report[cols]

            Country_Region  Confirmed  Deaths
0              Afghanistan     209322    7896
1                  Albania     334391    3598
2                  Algeria     271441    6881
3                  Andorra      47866     165
4                   Angola     105255    1933
...                    ...        ...     ...
4011    West Bank and Gaza     703228    5708
4012  Winter Olympics 2022        535       0
4013                 Yemen      11945    2159
4014                Zambia     343012    4057
4015              Zimbabwe     263921    5663

[4016 rows x 3 columns]

## Filtering rows with conditional statements

In [13]:
is_taiwan = daily_report['Country_Region'] == 'Taiwan*'
daily_report[is_taiwan]

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
667,NaN,NaN,NaN,Taiwan*,2023-03-01 04:21:02,23.7,121.0,9970937,17672,NaN,NaN,Taiwan*,41865.185358,0.177235

## Subsetting columns and rows simultaneously

In [14]:
cols_to_select = ['Country_Region', 'Confirmed', 'Deaths']
rows_to_filter = daily_report['Country_Region'] == 'Taiwan*'
daily_report[rows_to_filter][cols_to_select]

    Country_Region  Confirmed  Deaths
667        Taiwan*    9970937   17672

## Indexing `DataFrame` with

- `loc[]`
- `iloc[]`

## `loc[]` is indexing `DataFrame` with `Index`

In [15]:
taiwan_row_index = daily_report[is_taiwan].index[0]
print(daily_report.loc[taiwan_row_index, ['Country_Region', 'Confirmed']]) # as Series
daily_report.loc[[taiwan_row_index], ['Country_Region', 'Confirmed']] # as DataFrame

Country_Region    Taiwan*
Confirmed         9970937
Name: 667, dtype: object

    Country_Region  Confirmed
667        Taiwan*    9970937

## `iloc[]` is indexing `DataFrame` with absolute position

In [16]:
print(daily_report.iloc[taiwan_row_index, [3, 7]]) # as Series
daily_report.iloc[[taiwan_row_index], [3, 7]] # as DataFrame

Country_Region    Taiwan*
Confirmed         9970937
Name: 667, dtype: object

    Country_Region  Confirmed
667        Taiwan*    9970937

## Sorting `DataFrame` with

- `sort_values`
- `sort_index`

## `sort_values` sorts `DataFrame` with specific columns

In [17]:
daily_report.sort_values(['Country_Region', 'Confirmed'])

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
0,NaN,NaN,NaN,Afghanistan,2023-03-01 04:21:02,33.939110,67.709953,209322,7896,NaN,NaN,Afghanistan,537.711073,3.772179
1,NaN,NaN,NaN,Albania,2023-03-01 04:21:02,41.153300,20.168300,334391,3598,NaN,NaN,Albania,11619.674752,1.075986
2,NaN,NaN,NaN,Algeria,2023-03-01 04:21:02,28.033900,1.659600,271441,6881,NaN,NaN,Algeria,619.006941,2.534989
3,NaN,NaN,NaN,Andorra,2023-03-01 04:21:02,42.506300,1.521800,47866,165,NaN,NaN,Andorra,61950.430337,0.344712
4,NaN,NaN,NaN,Angola,2023-03-01 04:21:02,-11.202700,17.873900,105255,1933,NaN,NaN,Angola,320.252363,1.836492
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4011,NaN,NaN,NaN,West Bank and Gaza,2023-03-01 04:21:02,31.952200,35.233200,703228,5708,NaN,NaN,West Bank and Gaza,13784.956961,0.811686
4012,NaN,NaN,NaN,Winter Olympics 2022,2023-03-01 04:21:02,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4013,NaN,NaN,NaN,Yemen,2023-03-01 04:21:02,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4014,NaN,NaN,NaN,Zambia,2023-03-01 04:21:02,-13.133897,27.849332,343012,4057,NaN,NaN,Zambia,1865.822568,1.182757
4015,NaN,NaN,NaN,Zimbabwe,2023-03-01 04:21:02,-19.015438,29.154857,263921,5663,NaN,NaN,Zimbabwe,1775.700035,2.145718

## `sort_index` sorts `DataFrame` with the `Index` of `DataFrame`

In [18]:
daily_report.sort_index(ascending=False)

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key,Incident_Rate,Case_Fatality_Ratio
4015,NaN,NaN,NaN,Zimbabwe,2023-03-01 04:21:02,-19.015438,29.154857,263921,5663,NaN,NaN,Zimbabwe,1775.700035,2.145718
4014,NaN,NaN,NaN,Zambia,2023-03-01 04:21:02,-13.133897,27.849332,343012,4057,NaN,NaN,Zambia,1865.822568,1.182757
4013,NaN,NaN,NaN,Yemen,2023-03-01 04:21:02,15.552727,48.516388,11945,2159,NaN,NaN,Yemen,40.048994,18.074508
4012,NaN,NaN,NaN,Winter Olympics 2022,2023-03-01 04:21:02,39.904200,116.407400,535,0,NaN,NaN,Winter Olympics 2022,NaN,0.000000
4011,NaN,NaN,NaN,West Bank and Gaza,2023-03-01 04:21:02,31.952200,35.233200,703228,5708,NaN,NaN,West Bank and Gaza,13784.956961,0.811686
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4,NaN,NaN,NaN,Angola,2023-03-01 04:21:02,-11.202700,17.873900,105255,1933,NaN,NaN,Angola,320.252363,1.836492
3,NaN,NaN,NaN,Andorra,2023-03-01 04:21:02,42.506300,1.521800,47866,165,NaN,NaN,Andorra,61950.430337,0.344712
2,NaN,NaN,NaN,Algeria,2023-03-01 04:21:02,28.033900,1.659600,271441,6881,NaN,NaN,Algeria,619.006941,2.534989
1,NaN,NaN,NaN,Albania,2023-03-01 04:21:02,41.153300,20.168300,334391,3598,NaN,NaN,Albania,11619.674752,1.075986
0,NaN,NaN,NaN,Afghanistan,2023-03-01 04:21:02,33.939110,67.709953,209322,7896,NaN,NaN,Afghanistan,537.711073,3.772179

## Deriving new variables from `DataFrame`

- Simple operations
- `map` with a `dict`
- `map` with a function(or a lambda expression)

## Deriving new variable with simple operations

In [19]:
case_fatality_ratio = daily_report['Deaths'] / daily_report['Confirmed']
case_fatality_ratio

0       0.037722
1       0.010760
2       0.025350
3       0.003447
4       0.018365
          ...
4011    0.008117
4012    0.000000
4013    0.180745
4014    0.011828
4015    0.021457
Length: 4016, dtype: float64

## Deriving categorical from categorical with `map`

- Passing a `dict`
- Passing a function(or lambda expression)

In [20]:
# Passing a dict
country_name = {
    'Taiwan*': 'Taiwan'
}
daily_report_tw = daily_report[is_taiwan]
daily_report_tw['Country_Region'].map(country_name)

667    Taiwan
Name: Country_Region, dtype: object

In [21]:
# Passing a function
def replace_asterisk(x):
    if "*" in x:
        return x.replace("*", "")
    else:
        return x

daily_report['Country_Region'].map(replace_asterisk)[taiwan_row_index]

'Taiwan'

In [22]:
# Passing a lambda expression)
daily_report['Country_Region'].map(lambda x: x.replace("*", "") if "*" in x else x)[taiwan_row_index]

'Taiwan'

## Summarizing `DataFrame` with aggregate methods

In [23]:
daily_report['Confirmed'].sum()

675322238

## Summarizing and grouping `DataFrame` with aggregate methods

In [24]:
daily_report.groupby('Country_Region')['Confirmed'].sum()

Country_Region
Afghanistan             209322
Albania                 334391
Algeria                 271441
Andorra                  47866
Angola                  105255
                         ...
West Bank and Gaza      703228
Winter Olympics 2022       535
Yemen                    11945
Zambia                  343012
Zimbabwe                263921
Name: Confirmed, Length: 201, dtype: int64

## Advanced Wrangling

## Other common wranglings including

- Dealing with missing values.
- Dealing with text values.
- Reshaping dataframes.
- Concatenating, merging and joining dataframes.

## Dealing with missing values

- Using `isnull` or `notnull` to check if `np.nan` exists.
- Using `dropna` to drop rows with `np.nan`.
- Using `fillna` to fill `np.nan` with specific values.

In [25]:
print(daily_report['Province_State'].size)
print(daily_report['Province_State'].isnull().sum())
print(daily_report['Province_State'].notnull().sum())

4016
179
3837

In [26]:
print(daily_report.dropna().shape)
print(daily_report['FIPS'].fillna(0))

(0, 14)
0       0.0
1       0.0
2       0.0
3       0.0
4       0.0
       ...
4011    0.0
4012    0.0
4013    0.0
4014    0.0
4015    0.0
Name: FIPS, Length: 4016, dtype: float64

## Summarizing text columns

- `unique`
- `nunique`
- `value_counts`

In [27]:
print(daily_report['Country_Region'].nunique())
print(daily_report['Country_Region'].unique())

201
['Afghanistan' 'Albania' 'Algeria' 'Andorra' 'Angola' 'Antarctica'
 'Antigua and Barbuda' 'Argentina' 'Armenia' 'Australia' 'Austria'
 'Azerbaijan' 'Bahamas' 'Bahrain' 'Bangladesh' 'Barbados' 'Belarus'
 'Belgium' 'Belize' 'Benin' 'Bhutan' 'Bolivia' 'Bosnia and Herzegovina'
 'Botswana' 'Brazil' 'Brunei' 'Bulgaria' 'Burkina Faso' 'Burma' 'Burundi'
 'Cabo Verde' 'Cambodia' 'Cameroon' 'Canada' 'Central African Republic'
 'Chad' 'Chile' 'China' 'Colombia' 'Comoros' 'Congo (Brazzaville)'
 'Congo (Kinshasa)' 'Costa Rica' "Cote d'Ivoire" 'Croatia' 'Cuba' 'Cyprus'
 'Czechia' 'Denmark' 'Diamond Princess' 'Djibouti' 'Dominica'
 'Dominican Republic' 'Ecuador' 'Egypt' 'El Salvador' 'Equatorial Guinea'
 'Eritrea' 'Estonia' 'Eswatini' 'Ethiopia' 'Fiji' 'Finland' 'France'
 'Gabon' 'Gambia' 'Georgia' 'Germany' 'Ghana' 'Greece' 'Grenada'
 'Guatemala' 'Guinea' 'Guinea-Bissau' 'Guyana' 'Haiti' 'Holy See'
 'Honduras' 'Hungary' 'Iceland' 'India' 'Indonesia' 'Iran' 'Iraq'
 'Ireland' 'Israel' 'Italy' 'Jamaica' 'Japan' 'Jordan' 'Kazakhstan'
 'Kenya' 'Kiribati' 'Korea, North' 'Korea, South' 'Kosovo' 'Kuwait'
 'Kyrgyzstan' 'Laos' 'Latvia' 'Lebanon' 'Lesotho' 'Liberia' 'Libya'
 'Liechtenstein' 'Lithuania' 'Luxembourg' 'MS Zaandam' 'Madagascar'
 'Malawi' 'Malaysia' 'Maldives' 'Mali' 'Malta' 'Marshall Islands'
 'Mauritania' 'Mauritius' 'Mexico' 'Micronesia' 'Moldova' 'Monaco'
 'Mongolia' 'Montenegro' 'Morocco' 'Mozambique' 'Namibia' 'Nauru' 'Nepal'
 'Netherlands' 'New Zealand' 'Nicaragua' 'Niger' 'Nigeria'
 'North Macedonia' 'Norway' 'Oman' 'Pakistan' 'Palau' 'Panama'
 'Papua New Guinea' 'Paraguay' 'Peru' 'Philippines' 'Poland' 'Portugal'
 'Qatar' 'Romania' 'Russia' 'Rwanda' 'Saint Kitts and Nevis' 'Saint Lucia'
 'Saint Vincent and the Grenadines' 'Samoa' 'San Marino'
 'Sao Tome and Principe' 'Saudi Arabia' 'Senegal' 'Serbia' 'Seychelles'
 'Sierra Leone' 'Singapore' 'Slovakia' 'Slovenia' 'Solomon Islands'
 'Somalia' 'South Africa' 'South Sudan' 'Spain' 'Sri Lanka' 'Sudan'
 'Summer Olympics 2020' 'Suriname' 'Sweden' 'Switzerland' 'Syria'
 'Taiwan*' 'Tajikistan' 'Tanzania' 'Thailand' 'Timor-Leste' 'Togo' 'Tonga'
 'Trinidad and Tobago' 'Tunisia' 'Turkey' 'Tuvalu' 'US' 'Uganda' 'Ukraine'
 'United Arab Emirates' 'United Kingdom' 'Uruguay' 'Uzbekistan' 'Vanuatu'
 'Venezuela' 'Vietnam' 'West Bank and Gaza' 'Winter Olympics 2022' 'Yemen'
 'Zambia' 'Zimbabwe']

In [28]:
daily_report['Country_Region'].value_counts()

US          3279
Russia        83
Japan         49
India         37
China         34
            ...
Guyana         1
Haiti          1
Holy See       1
Honduras       1
Zimbabwe       1
Name: Country_Region, Length: 201, dtype: int64

## Splitting strings with `str.split` as a `Series`

In [29]:
request_url = "https://www.imdb.com/chart/top"
html_tables = pd.read_html(request_url)
html_table = html_tables[0]
html_table.head()

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
0,NaN,1. 刺激1995 (1994),9.2,12345678910 NOT YET RELEASED Seen,NaN
1,NaN,2. 教父 (1972),9.2,12345678910 NOT YET RELEASED Seen,NaN
2,NaN,3. 黑暗騎士 (2008),9.0,12345678910 NOT YET RELEASED Seen,NaN
3,NaN,4. 教父2 (1974),9.0,12345678910 NOT YET RELEASED Seen,NaN
4,NaN,5. 十二怒漢 (1957),9.0,12345678910 NOT YET RELEASED Seen,NaN

In [30]:
html_table['Rank & Title'].str.split()

0      [1., 刺激1995, (1994)]
1          [2., 教父, (1972)]
2        [3., 黑暗騎士, (2008)]
3         [4., 教父2, (1974)]
4        [5., 十二怒漢, (1957)]
               ...
245    [246., 萬世魔星, (1979)]
246     [247., 鐵巨人, (1999)]
247      [248., 姊妹, (2011)]
248     [249., 阿拉丁, (1992)]
249    [250., 與狼共舞, (1990)]
Name: Rank & Title, Length: 250, dtype: object

## Splitting strings with `str.split` as a `DataFrame`

In [31]:
html_table['Rank & Title'].str.split(expand=True)

        0       1       2     3
0      1.  刺激1995  (1994)  None
1      2.      教父  (1972)  None
2      3.    黑暗騎士  (2008)  None
3      4.     教父2  (1974)  None
4      5.    十二怒漢  (1957)  None
..    ...     ...     ...   ...
245  246.    萬世魔星  (1979)  None
246  247.     鐵巨人  (1999)  None
247  248.      姊妹  (2011)  None
248  249.     阿拉丁  (1992)  None
249  250.    與狼共舞  (1990)  None

[250 rows x 4 columns]

## Replacing strings with `str.replace`

In [32]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
ranks = split_dataframe[0].str.replace(".", '', regex=False)
ranks

0        1
1        2
2        3
3        4
4        5
      ...
245    246
246    247
247    248
248    249
249    250
Name: 0, Length: 250, dtype: object

In [33]:
split_dataframe = html_table['Rank & Title'].str.split(expand=True)
years = split_dataframe[2].str.replace("\(|\)", '', regex=True)
years

0      1994
1      1972
2      2008
3      1974
4      1957
       ...
245    1979
246    1999
247    2011
248    1992
249    1990
Name: 2, Length: 250, dtype: object

## Testing for strings that match or contain a pattern with `str.contains`

In [34]:
print(html_table['Rank & Title'].str.contains('魔戒').sum())
html_table[html_table['Rank & Title'].str.contains('魔戒')]

3

,Unnamed: 0,Rank & Title,IMDb Rating,Your Rating,Unnamed: 4
6,NaN,7. 魔戒三部曲：王者再臨 (2003),8.9,12345678910 NOT YET RELEASED Seen,NaN
8,NaN,9. 魔戒首部曲：魔戒現身 (2001),8.8,12345678910 NOT YET RELEASED Seen,NaN
12,NaN,13. 魔戒二部曲：雙城奇謀 (2002),8.7,12345678910 NOT YET RELEASED Seen,NaN

## Two formats of a table

- Wide: data is presented with each different data variable in a separate column.
- Long: data is presented with one column containing all the values and another column listing the context of the value.

Source: <https://en.wikipedia.org/wiki/Wide_and_narrow_data>

## Wide, or unstacked data

In [35]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
wide_format = pd.read_html(request_url)[0]
wide_format

  Person  Age  Weight  Height
0    Bob   32     168     180
1  Alice   24     150     175
2  Steve   64     144     165

## Narrow, stacked, or long data

In [36]:
request_url = "https://en.wikipedia.org/wiki/Wide_and_narrow_data"
long_format = pd.read_html(request_url)[1]
long_format

  Person Variable  Value
0    Bob      Age     32
1    Bob   Weight    168
2    Bob   Height    180
3  Alice      Age     24
4  Alice   Weight    150
5  Alice   Height    175
6  Steve      Age     64
7  Steve   Weight    144
8  Steve   Height    165

## Reshaping dataframes from wide to long format with `pd.melt()`

In [37]:
pd.melt(wide_format, 
        id_vars="Person", value_vars=["Age", "Weight", "Height"],
        var_name="Variable", value_name="Value")

  Person Variable  Value
0    Bob      Age     32
1  Alice      Age     24
2  Steve      Age     64
3    Bob   Weight    168
4  Alice   Weight    150
5  Steve   Weight    144
6    Bob   Height    180
7  Alice   Height    175
8  Steve   Height    165

## Reshaping dataframes from long to wide format with `pivot()`

In [38]:
long_format.pivot(index="Person", columns="Variable", values="Value").reset_index().rename_axis(None, axis=1)

  Person  Age  Height  Weight
0  Alice   24     175     150
1    Bob   32     180     168
2  Steve   64     165     144

## A common problem is that a dataset where some of the column names are not names of variables, but values of a variable

In [39]:
ts_confirmed_global_url = "https://raw.githubusercontent.com/CSSEGISandData\
/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series\
/time_series_covid19_confirmed_global.csv"
ts_confirmed_global = pd.read_csv(ts_confirmed_global_url)
ts_confirmed_global

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,2/28/23,3/1/23,3/2/23,3/3/23,3/4/23,3/5/23,3/6/23,3/7/23,3/8/23,3/9/23
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,209322,209340,209358,209362,209369,209390,209406,209436,209451,209451
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,334391,334408,334408,334427,334427,334427,334427,334427,334443,334457
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,271441,271448,271463,271469,271469,271477,271477,271490,271494,271496
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,47866,47875,47875,47875,47875,47875,47875,47875,47890,47890
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,105255,105277,105277,105277,105277,105277,105277,105277,105288,105288
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
284,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,703228,703228,703228,703228,703228,703228,703228,703228,703228,703228
285,NaN,Winter Olympics 2022,39.904200,116.407400,0,0,0,0,0,0,...,535,535,535,535,535,535,535,535,535,535
286,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,11945,11945,11945,11945,11945,11945,11945,11945,11945,11945
287,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,343012,343012,343079,343079,343079,343135,343135,343135,343135,343135
288,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,263921,264127,264127,264127,264127,264127,264127,264127,264276,264276

## We can pivot the columns into a new pair of variables

To describe that operation we need four parameters:

- The set of columns whose names are not values
- The set of columns whose names are values
- The name of the variable to move the column names to
- The name of the variable to move the column values to

## In this example, the four parameters are

- `id_vars`: `['Province/State', 'Country/Region', 'Lat', 'Long']`
- `value_vars`: The columns from `1/22/20` to the last column
- `var_name`: Let's name it `Date`
- `value_name`: Let's name it `Confirmed`

In [40]:
idVars = ['Province/State', 'Country/Region', 'Lat', 'Long']
ts_confirmed_global_long = pd.melt(ts_confirmed_global,
                                   id_vars=idVars,
                                   var_name='Date',
                                   value_name='Confirmed')
ts_confirmed_global_long

,Province/State,Country/Region,Lat,Long,Date,Confirmed
0,NaN,Afghanistan,33.939110,67.709953,1/22/20,0
1,NaN,Albania,41.153300,20.168300,1/22/20,0
2,NaN,Algeria,28.033900,1.659600,1/22/20,0
3,NaN,Andorra,42.506300,1.521800,1/22/20,0
4,NaN,Angola,-11.202700,17.873900,1/22/20,0
...,...,...,...,...,...,...
330322,NaN,West Bank and Gaza,31.952200,35.233200,3/9/23,703228
330323,NaN,Winter Olympics 2022,39.904200,116.407400,3/9/23,535
330324,NaN,Yemen,15.552727,48.516388,3/9/23,11945
330325,NaN,Zambia,-13.133897,27.849332,3/9/23,343135
330326,NaN,Zimbabwe,-19.015438,29.154857,3/9/23,264276

## Concatenating, merging and joining dataframes

- `concat()` vertically or horizontally.
- `merge()` horizontally on column names.
- `join()` horizontally on index.

In [41]:
def get_top_rated_movies():
    request_url = "https://www.imdb.com/chart/top"
    html_tables = pd.read_html(request_url)
    html_table = html_tables[0]
    split_dataframe = html_table['Rank & Title'].str.split(expand=True)
    ranks = split_dataframe[0].str.replace(".", '', regex=False).values
    split_series = html_table['Rank & Title'].str.split()
    years, titles = list(), list()
    for lst in split_series:
        year = re.sub("\(|\)", '', lst[-1])
        title = " ".join(lst[1:-1])
        years.append(int(year))
        titles.append(title)
    ratings = html_table['IMDb Rating'].values
    out = pd.DataFrame()
    out['rank'] = ranks
    out['title'] = titles
    out['year'] = years
    out['rating'] = ratings
    return out

top_rated_movies = get_top_rated_movies()

In [42]:
batman_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("蝙蝠俠|黑暗騎士", regex=True)]
batman_trilogy

    rank      title  year  rating
2      3       黑暗騎士  2008     9.0
68    69  黑暗騎士：黎明昇起  2012     8.3
126  127   蝙蝠俠：開戰時刻  2005     8.2

In [43]:
lord_of_the_rings_trilogy = top_rated_movies[top_rated_movies["title"].str.contains("魔戒", regex=False)]
lord_of_the_rings_trilogy

   rank       title  year  rating
6     7  魔戒三部曲：王者再臨  2003     8.9
8     9  魔戒首部曲：魔戒現身  2001     8.8
12   13  魔戒二部曲：雙城奇謀  2002     8.7

## Use `concat()` function to concatenate vertically or horizontally

In [44]:
pd.concat((batman_trilogy, lord_of_the_rings_trilogy))

    rank       title  year  rating
2      3        黑暗騎士  2008     9.0
68    69   黑暗騎士：黎明昇起  2012     8.3
126  127    蝙蝠俠：開戰時刻  2005     8.2
6      7  魔戒三部曲：王者再臨  2003     8.9
8      9  魔戒首部曲：魔戒現身  2001     8.8
12    13  魔戒二部曲：雙城奇謀  2002     8.7

In [45]:
pd.concat((batman_trilogy["title"], lord_of_the_rings_trilogy["title"]), axis=1)

         title       title
2         黑暗騎士         NaN
68   黑暗騎士：黎明昇起         NaN
126   蝙蝠俠：開戰時刻         NaN
6          NaN  魔戒三部曲：王者再臨
8          NaN  魔戒首部曲：魔戒現身
12         NaN  魔戒二部曲：雙城奇謀

In [46]:
pd.concat((batman_trilogy["title"].reset_index(drop=True),
           lord_of_the_rings_trilogy["title"].reset_index(drop=True)),
          axis=1)

       title       title
0       黑暗騎士  魔戒三部曲：王者再臨
1  黑暗騎士：黎明昇起  魔戒首部曲：魔戒現身
2   蝙蝠俠：開戰時刻  魔戒二部曲：雙城奇謀

In [47]:
left_df = top_rated_movies.loc[:9, ['title', 'year']]
right_df = top_rated_movies[top_rated_movies['title'].str.contains('魔戒')][['title', 'rating']].reset_index(drop=True)
left_df

        title  year
0      刺激1995  1994
1          教父  1972
2        黑暗騎士  2008
3         教父2  1974
4        十二怒漢  1957
5      辛德勒的名單  1993
6  魔戒三部曲：王者再臨  2003
7       黑色追緝令  1994
8  魔戒首部曲：魔戒現身  2001
9       黃昏三鏢客  1966

In [48]:
right_df

        title  rating
0  魔戒三部曲：王者再臨     8.9
1  魔戒首部曲：魔戒現身     8.8
2  魔戒二部曲：雙城奇謀     8.7

## Using `merge` function to join dataframes on columns

In [49]:
# default: inner join
pd.merge(left_df, right_df)

        title  year  rating
0  魔戒三部曲：王者再臨  2003     8.9
1  魔戒首部曲：魔戒現身  2001     8.8

In [50]:
# left join
pd.merge(left_df, right_df, how='left')

        title  year  rating
0      刺激1995  1994     NaN
1          教父  1972     NaN
2        黑暗騎士  2008     NaN
3         教父2  1974     NaN
4        十二怒漢  1957     NaN
5      辛德勒的名單  1993     NaN
6  魔戒三部曲：王者再臨  2003     8.9
7       黑色追緝令  1994     NaN
8  魔戒首部曲：魔戒現身  2001     8.8
9       黃昏三鏢客  1966     NaN

In [51]:
# right join
pd.merge(left_df, right_df, how='right')

        title    year  rating
0  魔戒三部曲：王者再臨  2003.0     8.9
1  魔戒首部曲：魔戒現身  2001.0     8.8
2  魔戒二部曲：雙城奇謀     NaN     8.7

## Using `join` method to join dataframes on index

In [52]:
# join dataframes on index
left_df.join(right_df, lsuffix='_x', rsuffix='_y')

      title_x  year     title_y  rating
0      刺激1995  1994  魔戒三部曲：王者再臨     8.9
1          教父  1972  魔戒首部曲：魔戒現身     8.8
2        黑暗騎士  2008  魔戒二部曲：雙城奇謀     8.7
3         教父2  1974         NaN     NaN
4        十二怒漢  1957         NaN     NaN
5      辛德勒的名單  1993         NaN     NaN
6  魔戒三部曲：王者再臨  2003         NaN     NaN
7       黑色追緝令  1994         NaN     NaN
8  魔戒首部曲：魔戒現身  2001         NaN     NaN
9       黃昏三鏢客  1966         NaN     NaN

In [53]:
left_df = left_df.set_index('title')
right_df = right_df.set_index('title')
# default: left join
left_df.join(right_df)

            year  rating
title
刺激1995      1994     NaN
教父          1972     NaN
黑暗騎士        2008     NaN
教父2         1974     NaN
十二怒漢        1957     NaN
辛德勒的名單      1993     NaN
魔戒三部曲：王者再臨  2003     8.9
黑色追緝令       1994     NaN
魔戒首部曲：魔戒現身  2001     8.8
黃昏三鏢客       1966     NaN

In [54]:
# inner join
left_df.join(right_df, how='inner')

            year  rating
title
魔戒三部曲：王者再臨  2003     8.9
魔戒首部曲：魔戒現身  2001     8.8

In [55]:
# right join
left_df.join(right_df, how='right')

              year  rating
title
魔戒三部曲：王者再臨  2003.0     8.9
魔戒首部曲：魔戒現身  2001.0     8.8
魔戒二部曲：雙城奇謀     NaN     8.7